print('Задача 4. Отрезок')
print('===' * 15)  # Разделитель.

# Напишите программу,
# которая считывает с клавиатуры два числа a, b и c,
# считает и выводит на консоль среднее арифметическое
# всех чисел из отрезка [a; b], которые кратны числу c.
# Подсказка: (a и b  являются промежутком, а c для проверки кратности).
